{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Myles\OneDrive\Documents\Alex Research\SocialComparison\Scripts\../Log Files/summarylog_envy3.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 Oct 2024, 20:32:53
{txt}
{com}. 
. describe, full 

{txt}Contains data from {res}../Clean STATA Files/Envy_3_V1_clean.dtA
{txt} Observations:{res}           198                  
{txt}    Variables:{res}            18                  3 Oct 2024 20:32
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:case_a_envy_1  }{txt}{bind: byte    }{bind:%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}case_a_envy_1{p_end}
{p 0 48}{bind:case_a_wtp     }{txt}{bind: int     }{bind:%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}case_a_wtp{p_end}
{p 0 48}{bind:case_b_envy_1  }{txt}{bind: byte    }{bind:%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}case_b_envy_1{p_end}
{p 0 48}{bind:case_b_wtp     }{txt}{bind: int     }{bind:%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}case_b_wtp{p_end}
{p 0 48}{bind:case_c_envy_1  }{txt}{bind: byte    }{bind:%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}case_c_envy_1{p_end}
{p 0 48}{bind:case_c_wtp     }{txt}{bind: byte    }{bind:%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}case_c_wtp{p_end}
{p 0 48}{bind:case_d_envy_1  }{txt}{bind: byte    }{bind:%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}case_d_envy_1{p_end}
{p 0 48}{bind:case_d_wtp     }{txt}{bind: byte    }{bind:%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}case_d_wtp{p_end}
{p 0 48}{bind:PROLIFIC_PID   }{txt}{bind: str24   }{bind:%24s      }{space 1}{bind:         }{bind:  }{res}{res}PROLIFIC_PID{p_end}
{p 0 48}{bind:WTP            }{txt}{bind: str3    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}WTP (Tasks) for favorite artwork{p_end}
{p 0 48}{bind:case_a_tag     }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}(0,0) -> (1,1){p_end}
{p 0 48}{bind:case_b_tag     }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}(0,0) -> (1,0){p_end}
{p 0 48}{bind:case_c_tag     }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}(0,1) -> (1,1){p_end}
{p 0 48}{bind:case_d_tag     }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}(0,1) -> (1,0){p_end}
{p 0 48}{bind:general_envy   }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Envy Level 0-10 of other participant{p_end}
{p 0 48}{bind:general_wtp    }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}WTP to obtain, destroy, or steal painting depending on cond.{p_end}
{p 0 48}{bind:cases          }{txt}{bind: str1    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:cases_numeric  }{txt}{bind: long    }{bind:%8.0g     }{space 1}{txt}cases_numeric{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}PROLIFIC_PID
{txt}
{com}. 
. summarize case* general_wtp general_envy

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
case_a_env~1 {c |}{res}         49    3.204082    3.529516          0         10
{txt}{space 2}case_a_wtp {c |}{res}         49    219.1633    1426.597          0      10000
{txt}case_b_env~1 {c |}{res}         50        1.68    3.046845          0         10
{txt}{space 2}case_b_wtp {c |}{res}         50        19.7    60.54084          0        400
{txt}case_c_env~1 {c |}{res}         49    5.204082    3.122363          0         10
{txt}{hline 13}{c +}{hline 57}
{space 2}case_c_wtp {c |}{res}         49    14.67347    25.80244          0        100
{txt}case_d_env~1 {c |}{res}         50        4.08    3.231478          0         10
{txt}{space 2}case_d_wtp {c |}{res}         50         7.1    10.90824          0         50
{txt}{space 2}case_a_tag {c |}{res}        198    .2474747    .4326388          0          1
{txt}{space 2}case_b_tag {c |}{res}        198    .2525253    .4355622          0          1
{txt}{hline 13}{c +}{hline 57}
{space 2}case_c_tag {c |}{res}        198    .2474747    .4326388          0          1
{txt}{space 2}case_d_tag {c |}{res}        198    .2525253    .4355622          0          1
{txt}{space 7}cases {c |}{res}          0
{txt}cases_nume~c {c |}{res}        198    2.505051    1.120857          1          4
{txt}{space 1}general_wtp {c |}{res}        198    64.63636    710.5613          0      10000
{txt}{hline 13}{c +}{hline 57}
general_envy {c |}{res}        198    3.535354    3.462088          0         10
{txt}
{com}. 
. winsor2 general_wtp, trim cuts(5 95)
{txt}
{com}. 
. summarize case* general_wtp general_envy if !missing(general_wtp_tr)

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
case_a_env~1 {c |}{res}         45    3.088889    3.396671          0         10
{txt}{space 2}case_a_wtp {c |}{res}         45    9.688889     12.8926          0         50
{txt}case_b_env~1 {c |}{res}         47    1.765957     3.12224          0         10
{txt}{space 2}case_b_wtp {c |}{res}         47     7.12766    9.453817          0         50
{txt}case_c_env~1 {c |}{res}         47     5.06383    3.109622          0         10
{txt}{hline 13}{c +}{hline 57}
{space 2}case_c_wtp {c |}{res}         47    11.04255    19.09696          0         97
{txt}case_d_env~1 {c |}{res}         50        4.08    3.231478          0         10
{txt}{space 2}case_d_wtp {c |}{res}         50         7.1    10.90824          0         50
{txt}{space 2}case_a_tag {c |}{res}        189    .2380952     .427049          0          1
{txt}{space 2}case_b_tag {c |}{res}        189    .2486772    .4333944          0          1
{txt}{hline 13}{c +}{hline 57}
{space 2}case_c_tag {c |}{res}        189    .2486772    .4333944          0          1
{txt}{space 2}case_d_tag {c |}{res}        189    .2645503     .442265          0          1
{txt}{space 7}cases {c |}{res}          0
{txt}cases_nume~c {c |}{res}        189    2.539683    1.122669          1          4
{txt}{space 1}general_wtp {c |}{res}        189    8.703704     13.5618          0         97
{txt}{hline 13}{c +}{hline 57}
general_envy {c |}{res}        189    3.513228     3.41556          0         10
{txt}
{com}. 
. 
. 
. reg general_wtp case_b_tag case_c_tag case_d_tag

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       198
{txt}{hline 13}{c +}{hline 34}   F(3, 194)       = {res}     1.03
{txt}       Model {c |} {res} 1558853.35         3  519617.783   {txt}Prob > F        ={res}    0.3806
{txt}    Residual {c |} {res} 97905928.5       194  504669.734   {txt}R-squared       ={res}    0.0157
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0005
{txt}       Total {c |} {res} 99464781.8       197   504897.37   {txt}Root MSE        =   {res}  710.4

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} general_wtp{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}case_b_tag {c |}{col 14}{res}{space 2}-199.4633{col 26}{space 2} 142.8033{col 37}{space 1}   -1.40{col 46}{space 3}0.164{col 54}{space 4}-481.1095{col 67}{space 3} 82.18301
{txt}{space 2}case_c_tag {c |}{col 14}{res}{space 2}-204.4898{col 26}{space 2} 143.5227{col 37}{space 1}   -1.42{col 46}{space 3}0.156{col 54}{space 4} -487.555{col 67}{space 3} 78.57536
{txt}{space 2}case_d_tag {c |}{col 14}{res}{space 2}-212.0633{col 26}{space 2} 142.8033{col 37}{space 1}   -1.49{col 46}{space 3}0.139{col 54}{space 4}-493.7095{col 67}{space 3} 69.58301
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 219.1633{col 26}{space 2} 101.4859{col 37}{space 1}    2.16{col 46}{space 3}0.032{col 54}{space 4} 19.00597{col 67}{space 3} 419.3206
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg general_wtp_tr case_b_tag case_c_tag case_d_tag

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       189
{txt}{hline 13}{c +}{hline 34}   F(3, 185)       = {res}     0.99
{txt}       Model {c |} {res} 546.114027         3  182.038009   {txt}Prob > F        ={res}    0.3989
{txt}    Residual {c |} {res} 34031.2934       185  183.952937   {txt}R-squared       ={res}    0.0158
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0002
{txt}       Total {c |} {res} 34577.4074       188   183.92238   {txt}Root MSE        =   {res} 13.563

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}general_wt~r{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}case_b_tag {c |}{col 14}{res}{space 2}-2.561229{col 26}{space 2} 2.828734{col 37}{space 1}   -0.91{col 46}{space 3}0.366{col 54}{space 4}-8.141953{col 67}{space 3} 3.019495
{txt}{space 2}case_c_tag {c |}{col 14}{res}{space 2} 1.353664{col 26}{space 2} 2.828734{col 37}{space 1}    0.48{col 46}{space 3}0.633{col 54}{space 4} -4.22706{col 67}{space 3} 6.934388
{txt}{space 2}case_d_tag {c |}{col 14}{res}{space 2}-2.588889{col 26}{space 2} 2.786916{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4}-8.087112{col 67}{space 3} 2.909334
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 9.688889{col 26}{space 2} 2.021841{col 37}{space 1}    4.79{col 46}{space 3}0.000{col 54}{space 4} 5.700059{col 67}{space 3} 13.67772
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. anova general_wtp_tr cases_numeric

                         {txt}Number of obs = {res}       189    {txt}R-squared     ={res}  0.0158
                         {txt}Root MSE      =   {res} 13.5629    {txt}Adj R-squared ={res} -0.0002

                  {txt}Source {c |} Partial SS         df         MS        F    Prob>F
             {hline 12}{c +}{hline 52}
                   Model {c |} {res} 546.11403          3   182.03801      0.99  0.3989
                         {txt}{c |}
             cases_num~c {c |} {res} 546.11403          3   182.03801      0.99  0.3989
                         {txt}{c |}
                Residual {c |} {res} 34031.293        185   183.95294  
             {txt}{hline 12}{c +}{hline 52}
                   Total {c |} {res} 34577.407        188   183.92238  
{txt}
{com}. pwcompare cases_numeric, mcompare(bonferroni)
{res}
{txt}Pairwise comparisons of marginal linear predictions

{txt}{p2colset 1 10 10 2}{...}
{p2col:Margins:}{res:asbalanced}{p_end}
{p2colreset}{...}

{res}{txt}{hline 14}{c TT}{hline 13}
{col 15}{c |}    Number of
{col 15}{c |}  comparisons
{hline 14}{c +}{hline 13}
cases_numeric {c |}{col 15}{res}{space 4}        6
{txt}{hline 14}{c BT}{hline 13}

{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}{col 38}           Bon{col 52}ferroni
{col 15}{c |}   Contrast{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
cases_numeric {c |}
{space 6}b vs a  {c |}{col 15}{res}{space 2}-2.561229{col 27}{space 2} 2.828734{col 38}{space 5}-10.10525{col 52}{space 3} 4.982796
{txt}{space 6}c vs a  {c |}{col 15}{res}{space 2} 1.353664{col 27}{space 2} 2.828734{col 38}{space 5}-6.190361{col 52}{space 3} 8.897689
{txt}{space 6}d vs a  {c |}{col 15}{res}{space 2}-2.588889{col 27}{space 2} 2.786916{col 38}{space 5}-10.02139{col 52}{space 3} 4.843611
{txt}{space 6}c vs b  {c |}{col 15}{res}{space 2} 3.914894{col 27}{space 2} 2.797818{col 38}{space 5} -3.54668{col 52}{space 3} 11.37647
{txt}{space 6}d vs b  {c |}{col 15}{res}{space 2}-.0276596{col 27}{space 2} 2.755531{col 38}{space 5}-7.376458{col 52}{space 3} 7.321139
{txt}{space 6}d vs c  {c |}{col 15}{res}{space 2}-3.942553{col 27}{space 2} 2.755531{col 38}{space 5}-11.29135{col 52}{space 3} 3.406245
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. 
. reg general_wtp c.general_envy##case_b_tag c.general_envy#case_c_tag c.general_envy#case_d_tag

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       198
{txt}{hline 13}{c +}{hline 34}   F(5, 192)       = {res}     0.41
{txt}       Model {c |} {res} 1061274.25         5  212254.849   {txt}Prob > F        ={res}    0.8386
{txt}    Residual {c |} {res} 98403507.6       192  512518.269   {txt}R-squared       ={res}    0.0107
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0151
{txt}       Total {c |} {res} 99464781.8       197   504897.37   {txt}Root MSE        =   {res}  715.9

{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}              general_wtp{col 27}{c |} Coefficient{col 39}  Std. err.{col 51}      t{col 59}   P>|t|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}general_envy {c |}{col 27}{res}{space 2}-22.18931{col 39}{space 2} 25.37492{col 50}{space 1}   -0.87{col 59}{space 3}0.383{col 67}{space 4} -72.2387{col 80}{space 3} 27.86009
{txt}{space 13}1.case_b_tag {c |}{col 27}{res}{space 2}-154.8674{col 39}{space 2} 149.0069{col 50}{space 1}   -1.04{col 59}{space 3}0.300{col 67}{space 4}-448.7681{col 80}{space 3} 139.0332
{txt}{space 25} {c |}
case_b_tag#c.general_envy {c |}
{space 23}1  {c |}{col 27}{res}{space 2} 20.42884{col 39}{space 2} 42.07847{col 50}{space 1}    0.49{col 59}{space 3}0.628{col 67}{space 4}-62.56658{col 80}{space 3} 103.4243
{txt}{space 25} {c |}
case_c_tag#c.general_envy {c |}
{space 23}1  {c |}{col 27}{res}{space 2}-.2546363{col 39}{space 2} 27.40494{col 50}{space 1}   -0.01{col 59}{space 3}0.993{col 67}{space 4}-54.30804{col 80}{space 3} 53.79876
{txt}{space 25} {c |}
case_d_tag#c.general_envy {c |}
{space 23}1  {c |}{col 27}{res}{space 2}-3.564489{col 39}{space 2} 29.11325{col 50}{space 1}   -0.12{col 59}{space 3}0.903{col 67}{space 4}-60.98735{col 80}{space 3} 53.85838
{txt}{space 25} {c |}
{space 20}_cons {c |}{col 27}{res}{space 2}  177.525{col 39}{space 2} 93.66245{col 50}{space 1}    1.90{col 59}{space 3}0.060{col 67}{space 4}-7.214482{col 80}{space 3} 362.2645
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg general_wtp_tr c.general_envy##case_b_tag c.general_envy#case_c_tag c.general_envy#case_d_tag

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       189
{txt}{hline 13}{c +}{hline 34}   F(5, 183)       = {res}     1.77
{txt}       Model {c |} {res} 1595.55476         5  319.110952   {txt}Prob > F        ={res}    0.1209
{txt}    Residual {c |} {res} 32981.8526       183  180.228703   {txt}R-squared       ={res}    0.0461
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0201
{txt}       Total {c |} {res} 34577.4074       188   183.92238   {txt}Root MSE        =   {res} 13.425

{txt}{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           general_wtp_tr{col 27}{c |} Coefficient{col 39}  Std. err.{col 51}      t{col 59}   P>|t|{col 67}     [95% con{col 80}f. interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}general_envy {c |}{col 27}{res}{space 2} .7993203{col 39}{space 2} .5128966{col 50}{space 1}    1.56{col 59}{space 3}0.121{col 67}{space 4}-.2126309{col 80}{space 3} 1.811271
{txt}{space 13}1.case_b_tag {c |}{col 27}{res}{space 2} .2000556{col 39}{space 2} 2.881233{col 50}{space 1}    0.07{col 59}{space 3}0.945{col 67}{space 4}-5.484651{col 80}{space 3} 5.884763
{txt}{space 25} {c |}
case_b_tag#c.general_envy {c |}
{space 23}1  {c |}{col 27}{res}{space 2}-.4371548{col 39}{space 2} .8154615{col 50}{space 1}   -0.54{col 59}{space 3}0.593{col 67}{space 4} -2.04607{col 80}{space 3}  1.17176
{txt}{space 25} {c |}
case_c_tag#c.general_envy {c |}
{space 23}1  {c |}{col 27}{res}{space 2} .2827692{col 39}{space 2} .5492087{col 50}{space 1}    0.51{col 59}{space 3}0.607{col 67}{space 4}-.8008261{col 80}{space 3} 1.366364
{txt}{space 25} {c |}
case_d_tag#c.general_envy {c |}
{space 23}1  {c |}{col 27}{res}{space 2}-.5617899{col 39}{space 2} .5713872{col 50}{space 1}   -0.98{col 59}{space 3}0.327{col 67}{space 4}-1.689144{col 80}{space 3} .5655638
{txt}{space 25} {c |}
{space 20}_cons {c |}{col 27}{res}{space 2} 6.288035{col 39}{space 2} 1.792606{col 50}{space 1}    3.51{col 59}{space 3}0.001{col 67}{space 4} 2.751201{col 80}{space 3} 9.824869
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Myles\OneDrive\Documents\Alex Research\SocialComparison\Scripts\../Log Files/summarylog_envy3.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 3 Oct 2024, 20:32:54
{txt}{.-}
{smcl}
{txt}{sf}{ul off}